<script setup lang='ts'>


// const isChatGPTAPI = computed<boolean>(() => !!authStore.isChatGPTAPI)

</script>

<template>
		<div class="p-4 space-y-4">
			<h2 class="text-xl font-bold">
				免责声明:
			</h2>
			<p>
				本网站以及其上所有信息仅作知识共享交流之用,不保证信息的真实可靠性。本网站未经合法授权不得用于任何商业用途,如有侵权请联系删除。

				本网站上所有信息仅代表个人立场与观点,并非本网站正式立场或表态。如有信息存在错误或侵犯他人合法权益,请及时与我们联系,我们将立即删除或更正。

				尽管本网站已采取一切合理措施保护用户信息,但本网站不对因用户在本网站上张贴信息而引起的任何纠纷或损失承担责任。

				用户在使用本网站服务时须遵守国家相关法律法规,不得传输任何违法信息。如果用户违反了相关法律法规,与本网站无关,本网站将根据有关部门要求予以配合。

				请用户谨慎发布个人信息,本网站对所有发布的信息不予审核,但保留删除信息的权利。任何人发布的信息纯属个人意愿,与本网站无关。</p>
		</div>
</template>
